/*XXX 的实验 5 程序：
 1. 调用实验 4 程序生成记录文件（文本方式）
 2. 调用实验 4 程序生成记录文件（二进制方式）
 3.读取指定数据记录文件（二维数组存储方式）
 4.读取指定数据记录文件（结构体数组存储方式）
 5.读取指定数据记录文件（指针数组存储方式）
 6.读取指定数据记录文件（链表存储方式）
 7. 调用实验 4 生成数据记录文件，同时读取数据记录文件（文本方式输出，二维数组方式存储）
 8. 调用实验 4 生成数据记录文件，同时读取数据记录文件（文本方式输出，结构体数组方式存储）
 9. 调用实验 4 生成数据记录文件，同时读取数据记录文件（文本方式输出，指针数组方式存储）
 10. 调用实验 4 生成数据记录文件，同时读取数据记录文件（文本方式输出，链表方式存储）
 11. 调用实验 4 生成数据记录文件，同时读取数据记录文件（二进制方式输出，二维数组方式存储）
 12. 调用实验 4 生成数据记录文件，同时读取数据记录文件（二进制方式输出，结构体数组方式存储）
 13. 调用实验 4 生成数据记录文件，同时读取数据记录文件（二进制方式输出，指针数组方式存储）
 14. 调用实验 4 生成数据记录文件，同时读取数据记录文件（二进制方式输出，链表方式存储）
3
 15. 重新设置配置参数值
 0. 退出
请输入您要执行的程序序号：
*/